app/interactors/create_event_gift.rb

INSERT INTO "event_gifts" ("title", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "jhh"], ["price", "hihi"], ["created_at", "2018-12-19 19:58:15.058048"], ["updated_at", "2018-12-19 19:58:15.058048"]]
---
  def create_event_gift
    @event_gift = EventGift.new(context.params)
    if @event_gift.save