app/mailers/invite_mailer.rb

    def invite_email(event_gift_id, sender_id, recipient_id)
      @event_gift = EventGift.find(event_gift_id)
      @sender = User.where(id: sender_id).first
      @recipient =  User.where(id: recipient_id).first
---
SELECT  "event_gifts".* FROM "event_gifts" WHERE "event_gifts"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 12], ["LIMIT", 1]]