app/controllers/event_gifts_controller.rb

  def index
    @event_gifts = EventGift.all
---
SELECT "event_gifts".* FROM "event_gifts"

  def destroy
    @event_gift.destroy
---
DELETE FROM "event_gifts" WHERE "event_gifts"."id" = $1  [["id", 12]]

    def set_event_gift
      @event_gift = EventGift.find(params[:id])
---
SELECT  "event_gifts".* FROM "event_gifts" WHERE "event_gifts"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]